# 5. Напишите программу, которая находит наибольшее и
# наименьшее число из списка значений

n = [1, 6, 4, 9, -6, 3]
print(n)
print(max(n))
print(min(n))