# 0. Демонстрация решения
# Напишите программу, которая на вход
# принимает число и выдаёт его квадрат (число
# умноженное на само себя).

n = int(input("введите число: "))

print(f'результат: 5 {n * n}')
